# -*- coding:utf-8 -*-  
__author__ = 'Mr.Lin'
__date__ = '2019/11/15 13:31'




"""
花式索引以及 ix函数
"""

import numpy as np

"""
创建一个5*5的数组
值全为0
"""
data = np.zeros((5,5,))
# print("data ----- >\n",data)

# 对每行进行赋值
for i in range(5):
    data[i] = i
# print("data ----- >\n",data)

"""
一维数组进行索引
"""

# print(data[[0,2,3]])
"""
获取第0 2 3 行数据

输出
[[0. 0. 0. 0. 0.]
 [2. 2. 2. 2. 2.]
 [3. 3. 3. 3. 3.]]
"""


"""
有负数的1维数组进行索引，就是从末尾开始选取行
"""

# print(data[[-4,-2,-1]])

"""
选取倒数第1 第3 第4行 

输出：

[[1. 1. 1. 1. 1.]
 [3. 3. 3. 3. 3.]
 [4. 4. 4. 4. 4.]]
 
 
"""
"""
顺序选取是从0开始数的，a[0]代表第一个；而逆序选取是从1开始数的，a[-1]是倒数第一个
"""

data2 = np.arange(32).reshape((4,8))

# print(data2)

"""
输出
[[ 0  1  2  3  4  5  6  7]
 [ 8  9 10 11 12 13 14 15]
 [16 17 18 19 20 21 22 23]
 [24 25 26 27 28 29 30 31]]
"""

"""
按坐标选取每一个数
"""

# print(data2[[0,1,2,3],[2,5,6,7]])

"""
输出

[ 2 13 22 31]、

对应数据索引
02
15
26
37

"""

"""
按我们要求选取行，再按顺序将列排序，获得一个矩形

"""

# print(data2[[1,3,0,2]][:,[0,3,1,2]])

"""
先按先选取第1、3、0、2行，每一行再按第0个、第3个、第1个、第2个排序

输出
[[ 8 11  9 10]
 [24 27 25 26]
 [ 0  3  1  2]
 [16 19 17 18]]

"""

"""
np.ix_函数，能把两个一维数组 转换为 一个用于选取方形区域的索引器
"""

"""
原理：np.ix_函数就是输入两个数组，产生笛卡尔积的映射关系
"""

print(data2[np.ix_([1,3,0,2],[0,3,1,2])])

"""
输出
[[ 8 11  9 10]
 [24 27 25 26]
 [ 0  3  1  2]
 [16 19 17 18]]
"""











