# -*- coding:utf-8 -*-  
__author__ = 'Mr.Lin'
__date__ = '2019/11/14 15:57'


import numpy as np
"""

多维数组实例
"""


"""
尺寸为2 x 3的二维数组，由4字节整数元素组成：
"""

x = np.array([
    [1, 2, 3],
    [4, 5, 6]
             ],
    np.int32)
print("x---->       ",x)
print("type---->",type(x))
print("shape----->",x.shape)
print("dtype------>",x.dtype)

"""
切片返回视图  对视图的操作会影响数据源
"""
y = x[1:2]
print("y---------->",y)

y[0] = [1000]

print("y---------->",y)
print("x---->       ",x)

"""
尺寸为 3 x 3 x 3 的三维数组，在其三个轴中的每个轴上求和
"""


xx = (
    [
        [
            [0,  1,  2],
            [3,  4,  5],
            [6,  7,  8]
        ],

        [
            [9, 10, 11],
            [12, 13, 14],
            [15, 16, 17]
        ],

        [
            [18, 19, 20],
            [21, 22, 23],
            [24, 25, 26]
        ]
    ]
)

print("xx------------>",xx)

xx.sum(0)











