# -*- coding:utf-8 -*-  
__author__ = 'Mr.Lin'
__date__ = '2019/11/16 14:58'




"""
4、数组拆分
split

沿指定轴在指定的位置拆分数组

hsplit、vsplit、dsplit

split的便捷化函数，分别沿轴0、轴1、轴2进行拆分
"""

import numpy as np

split_arr = np.arange(36).reshape(6, -1)

# print(split_arr)
# >>>
# [[ 0  1  2  3  4  5]
#  [ 6  7  8  9 10 11]
#  [12 13 14 15 16 17]
#  [18 19 20 21 22 23]
#  [24 25 26 27 28 29]
#  [30 31 32 33 34 35]]

# a, b, c = np.split(split_arr, 3, axis=0) # 可以查看函数说明

# print(a)
# print("")
# print(b)
# print("")
# print(c)
# >>>
# [[ 0  1  2  3  4  5]
#  [ 6  7  8  9 10 11]]
#
# [[12 13 14 15 16 17]
#  [18 19 20 21 22 23]]
#
# [[24 25 26 27 28 29]
#  [30 31 32 33 34 35]]

# a, b, c = np.split(split_arr, 3, axis=1) # 可以查看函数说明
# print(a)
# print("")
# print(b)
# print("")
# print(c)
# >>>
# [[ 0  1]
#  [ 6  7]
#  [12 13]
#  [18 19]
#  [24 25]
#  [30 31]]
#
# [[ 2  3]
#  [ 8  9]
#  [14 15]
#  [20 21]
#  [26 27]
#  [32 33]]
#
# [[ 4  5]
#  [10 11]
#  [16 17]
#  [22 23]
#  [28 29]
#  [34 35]]


# a, b, c, d = np.split(split_arr, [2, 4, 5], axis=1)

# print(a)
# print("")
# print(b)
# print("")
# print(c)
# print("")
# print(d)
#
# >>>
# [[ 0  1]
#  [ 6  7]
#  [12 13]
#  [18 19]
#  [24 25]
#  [30 31]]
#
# [[ 2  3]
#  [ 8  9]
#  [14 15]
#  [20 21]
#  [26 27]
#  [32 33]]
#
# [[ 4]
#  [10]
#  [16]
#  [22]
#  [28]
#  [34]]
#
# [[ 5]
#  [11]
#  [17]
#  [23]
#  [29]
#  [35]]





























































